package org.javaacademy.core.homework;

public class Homework1 {
    public static void main(String[] args) {
        ex2();
        System.out.println("___________________________________________");
        ex3();
        System.out.println("___________________________________________");
        ex4();
    }

    public static void ex1() {
        //Открыть класс Calc, там задание!
    }

    public static void ex2() {
        //Дана строка
        String name = "     ПЕтРов Олег Иванович     ";
        //Необходимо
        //1. убрать лишние пробелы
        //2. перевести текст в верхний регистр
        //3. Если содержит "ова " то печатаем на экран: Уважаемая {name}
        // Если содержит "ов " то печатаем на экран: Уважаемый {name}
        // В иных случаях печатаем на экран: Неизвестное лицо {name}

        String nameWithoutBlanks = name.trim();
        if (nameWithoutBlanks.contains("ов ")) {
            System.out.println("Уважаемый " + nameWithoutBlanks.toUpperCase());
        } else if (nameWithoutBlanks.contains("ова ")) {
            System.out.println("Уважаемая " + nameWithoutBlanks.toUpperCase());
        } else {
            System.out.println("Неизвестое лицо: " + nameWithoutBlanks.toUpperCase());
        }

    }

    public static void ex3() {
        //У нас есть машина. В данной машине есть перечень проверок, перед запуском двигателя
        //Количество топлива
        double fuel = 10;
        //Работоспособен или нет двигатель
        boolean isEngineWork = true;
        //Есть ли ошибки в компьютере (false - ошибок нет)
        boolean hasErrors = false;
        //Датчики давления шин
        boolean isWheelWork1 = true;
        boolean isWheelWork2 = true;
        boolean isWheelWork3 = true;
        boolean isWheelWork4 = true;
        boolean isWheelsWorks = isWheelWork1 && isWheelWork2 && isWheelWork3 && isWheelWork4;

        //Поменять(убрать, поставить) логические операторы так, чтобы машина запускалась:
        // когда топлива не меньше 10 литров, двигатель работает, колеса работают, нет ошибок
        //В ином случае, машина не должна запускаться
        if (
                (isWheelsWorks) && !hasErrors && isEngineWork && (fuel >= 10)
        )  {
            System.out.println("Машина едет");
        } else {
            System.out.println("Машина не едет");
        }
    }

    public static void ex4() {
        //Работа на самостоятельное изучение функций класса String.
        //Заменить в строке 'this is' на 'those are',
        //получить индекс (число) второй буквы 'o' в строке. ПОЛУЧЕНИЕ ИНДЕКСА ЧЕРЕЗ ФУНКЦИЮ!
        //Распечатать полученный индекс
        String simply = "this is simply. This is my favorite song.";
        String simplyReplace = simply.replace("this is", "those are"); //Замена this is на those are
        System.out.println(simplyReplace); //проверка
        System.out.println(simply.indexOf("o"));
        System.out.println(simply.indexOf("o",31));

    }
    }
}
